tap "beeftornado/rmtree"
tap "mongodb/brew"
# Universal Command-Line Interface for Alibaba Cloud
brew "aliyun-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Download with resuming and segmented downloading
brew "aria2"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Interpreted, interactive, object-oriented programming language
brew "python"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# SOCKS client wrapper for *BSD/macOS
brew "dsocks"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Asynchronous event library
brew "libevent"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Command-line utility for uploading Gists
brew "gist"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Improved colored diff
brew "icdiff"
# Native sequence editor for Git interactive rebase
brew "interactive-rebase-tool"
# Utility to optimize JPEG files
brew "jpegoptim"
# JSON parser for C
brew "json-c"
# Command-line tool to develop and manage LeanCloud apps
brew "lean-cli"
# Transcode video stabilization plugin
brew "libvidstab"
# C websockets server library
brew "libwebsockets"
# Real-time data compression library
brew "lzo"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Remote terminal application
brew "mosh"
# MP3 player for Linux and UNIX
brew "mpg123"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Hook preloader
brew "proxychains-ng"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Move files to macOS's Trash
brew "rmtrash"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# TCP connect to the given IP/port combo
brew "tcping"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Ncurses based file manager with vi like keybindings
brew "vifm"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# Dumb downloader that scrapes the web
brew "you-get"
# High-performance, schema-free, document-oriented database
# brew "mongodb/brew/mongodb-community"
cask "android-ndk"
cask "android-platform-tools"
cask "android-sdk"
cask "anki"
# cask "baiducloud"
cask "calibre"
# cask "docker"
cask "evernote"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "iina"
cask "iterm2"
# cask "java"
cask "postman"
cask "qq"
cask "spectacle"
cask "squirrel"
cask "tunnelblick"
cask "typora"
cask "v2rayu"
# cask "vagrant"
# cask "vagrant-manager"
cask "virtualbox"
cask "visual-studio-code"
# cask "xampp"
